TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ТипыВнешнихПробWarehouse/гкс_ТипыВнешнихПробWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ТипыВнешнихПробWarehouse</name>
  <predefined>
    <items>
      <name>ПробаПервогоДня</name>
      <description>1-й день</description>
    </items>
    <items>
      <name>Лаборант</name>
      <description>Лаборант</description>
    </items>
    <items>
      <name>ЛотНаТысячуТон</name>
      <description>Лот на 1000т </description>
    </items>
    <items>
      <name>Элеватор</name>
      <description>Элеватор</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомпозит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/ТранспортныеСредства/ТранспортныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТранспортныеСредства</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НомерТранспортногоСредства</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолеПоискаГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОсей</name>
    <type>
      <types>EnumRef.гкс_КоличествоОсейТранспортногоСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСправочникПЛК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/CommonModules/гкс_ОбменДаннымиWarehouse/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает и возвращает пустую таблицу значений для описания правил конвертации свойств объектов.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица описания конвертации реквизитов:
//     * СвойствоКонфигурации - Строка
//     * СвойствоИсточника - Строка
//     * ИспользуетсяАлгоритмКонвертации - Число
//     * ПравилоКонвертацииСвойства - Строка
//     * ЭтоТабличнаяЧасть - Булево
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	ОписаниеСтроки = Новый ОписаниеТипов("Строка");
	ОписаниеБулево = Новый ОписаниеТипов("Булево");
	
	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("СвойствоКонфигурации", ОписаниеСтроки);
	ПравилаКонвертации.Колонки.Добавить("СвойствоИсточника", ОписаниеСтроки);
	ПравилаКонвертации.Колонки.Добавить("ИспользуетсяАлгоритмКонвертации", ОписаниеЧисла);
	ПравилаКонвертации.Колонки.Добавить("ПравилоКонвертацииСвойства");
	ПравилаКонвертации.Колонки.Добавить("ЭтоТабличнаяЧасть", ОписаниеБулево);
		
	Возврат ПравилаКонвертации;
	
КонецФункции

// Добавляет правило конвертации свойства в таблицу правил обмена данными
//
// Параметры:
//   ПравилаКонвертации - ТаблицаЗначений - таблица правил конвертации свойств
//   СвойствоКонфигурации - Строка - имя свойства в конфигурации приемника
//   СвойствоИсточника - Строка - имя свойства в источнике данных
//   ИспользуетсяАлгоритмКонвертации - Число - признак использования алгоритма конвертации (0 - не используется)
//   ПравилоКонвертацииСвойства - Строка - имя правила конвертации свойства
//   ЭтоТабличнаяЧасть - Булево - признак того, что свойство является табличной частью
//
Процедура ДобавитьПКС(ПравилаКонвертации, СвойствоКонфигурации, СвойствоИсточника, ИспользуетсяАлгоритмКонвертации = 0, 
		ПравилоКонвертацииСвойства = "", ЭтоТабличнаяЧасть = Ложь) Экспорт
	
	НоваяСтрока                                 = ПравилаКонвертации.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоИсточника               = СвойствоИсточника;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;
	НоваяСтрока.ЭтоТабличнаяЧасть				= ЭтоТабличнаяЧасть;
	
КонецПроцедуры

// Возвращает структуру со значением ключевого свойства на основе правил конвертации.
//
// Параметры:
//   ПравилаКонвертации - ТаблицаЗначений - правила конвертации свойств
//   СтрокаДанных - Структура - строка исходных данных
//   ИмяКлючевогоСвойства - Строка - имя свойства источника
//
// Возвращаемое значение:
//   Структура - структура с одним свойством, содержащим значение ключевого свойства
//
Функция ЗначенияКлючевыхСвойств(ПравилаКонвертации, СтрокаДанных, ИмяКлючевогоСвойства) Экспорт
	
	Результат = Новый Структура;
		
	ПравилоКонвертацииКлючевогоЭлемента = ПравилаКонвертации.Найти(ИмяКлючевогоСвойства, "СвойствоИсточника");
	Если ПравилоКонвертацииКлючевогоЭлемента <> Неопределено Тогда
		Результат.Вставить(ПравилоКонвертацииКлючевогоЭлемента.СвойствоКонфигурации, 
							СтрокаДанных[ИмяКлючевогоСвойства]); 
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

// Обрабатывает полученные данные для справочников или документов, создавая новые элементы или обновляя существующие
//
// Параметры:
//   ПолученныеДанные - Структура, Массив из Структура - данные для заполнения объекта
//   СсылкаОбъекта - СправочникСсылка, ДокументСсылка - ссылка на обновляемый объект, если передана
//
Процедура ОбработатьПолученныеДанные(ПолученныеДанные, СсылкаОбъекта) Экспорт
	
	Перем ЗначениеКлючаПоиска;
	
	Если Не ЗначениеЗаполнено(ПолученныеДанные) Тогда
		Возврат;
	КонецЕсли;	
		
	ПолноеИмяОбъекта = ОбщегоНазначения.ИмяТаблицыПоСсылке(СсылкаОбъекта);
	ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоСсылке(СсылкаОбъекта);
	
	Менеджер = Общегоназначения.МенеджерОбъектаПоСсылке(СсылкаОбъекта);
//	ТипОбъектаXDO = Менеджер.ИмяТаблицыЭтран();
	ИмяКлюча = Менеджер.ИмяКлючевогоСвойстваВWarehouse();
	ПравилаКонвертации = Менеджер.ИнициализацияПравилКонвертацийСвойств();
	
	Если ВидОбъекта = "Справочник" Тогда
		
		ТекущиеДанныеИБ = ТаблицаЭлементовСправочника(ПолноеИмяОбъекта);
		 
		Для Каждого СтрокаДанных Из ПолученныеДанные Цикл
				
			ДанныеЗаполнения = СтрокаДанных; //  ПреобразованиеТипов(СтрокаДанных, ТипОбъектаXDO);
			
			Если ЗначениеЗаполнено(СсылкаОбъекта) Тогда
				ОбновляемыйЭлемент = СсылкаОбъекта.ПолучитьОбъект();
			Иначе
				
				ПараметрыОтбора = ЗначенияКлючевыхСвойств(ПравилаКонвертации, ДанныеЗаполнения, ИмяКлюча);
				
				НайденаяЗапись = НайтиСуществующийЭлемент(ТекущиеДанныеИБ, ПараметрыОтбора);	
				Если ЗначениеЗаполнено(НайденаяЗапись) Тогда
					ОбновляемыйЭлемент = НайденаяЗапись.ПолучитьОбъект();
					Попытка
						ОбновляемыйЭлемент.Заблокировать();
					Исключение
						Продолжить;
					КонецПопытки;	
				Иначе
					ОбновляемыйЭлемент = Менеджер.СоздатьЭлемент();
				КонецЕсли;
			КонецЕсли;

			ОбработатьОбъектКонвертации(ПравилаКонвертации, ДанныеЗаполнения, ОбновляемыйЭлемент);
			
		КонецЦикла;
		
	ИначеЕсли ВидОбъекта = "Документ" Тогда
					                     
		ДанныеЗаполнения = ПолученныеДанные; //  ПреобразованиеТипов(ПолученныеДанные, ТипОбъектаXDO)
		
		Если ЗначениеЗаполнено(СсылкаОбъекта) Тогда
			ОбновляемыйДокумент = СсылкаОбъекта.ПолучитьОбъект();
		Иначе
			Если ДанныеЗаполнения.Свойство(ИмяКлюча, ЗначениеКлючаПоиска) Тогда
				ОбновляемыйДокумент = ДокументПоВнешнемуИдентификатору(ЗначениеКлючаПоиска, ПолноеИмяОбъекта, Истина);
			Иначе                          
				ТекстИсключения = СтрШаблон("Не найдено ключевое поле %1", ИмяКлюча);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		КонецЕсли;
		
		ОбработатьОбъектКонвертации(ПравилаКонвертации, ДанныеЗаполнения, ОбновляемыйДокумент);	
	КонецЕсли;
	
КонецПроцедуры

// Заполняет свойства объекта данными, полученными при конвертации, и записывает объект.
//
//	Параметры:
//  	ПравилаКонвертации 	- ТаблицаЗначений - правила конвертации свойств объекта
//  	ПолученныеДанные 	- Структура - исходные данные для заполнения
//  	ОбновляемыйОбъект 	- Объект - обновляемый объект (ссылка или объект)
//		ПродолжитьПриОшибке - Булево - не прерывать загрузку при ошибке
//
Процедура ОбработатьОбъектКонвертации(ПравилаКонвертации, ПолученныеДанные, ОбновляемыйОбъект, ПродолжитьПриОшибке = Истина) Экспорт
		
	ДанныеЗаполнения = КонвертацияВДанныеЗаполненияОбъекта(ОбновляемыйОбъект, ПравилаКонвертации, ПолученныеДанные);
		
	Для Каждого ЗначениеЗаполнения Из ДанныеЗаполнения Цикл
		
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
			ОбновляемыйОбъект, ЗначениеЗаполнения.Ключ) Тогда
			Продолжить;
		КонецЕсли;
			
		ТипОписанияПравила = ТипЗнч(ЗначениеЗаполнения.Значение);	
		
		Если ТипОписанияПравила = Тип("ТаблицаЗначений") Тогда
			ОбновляемыйОбъект[ЗначениеЗаполнения.Ключ].Загрузить(ЗначениеЗаполнения.Значение);
		Иначе
			// из-за разниц форматов дат в зависимости от сервера делаем преобразование тут
			Если ТипЗнч(ОбновляемыйОбъект[ЗначениеЗаполнения.Ключ]) = Тип("Дата")
				И ТипОписанияПравила = Тип("Строка") Тогда
				
				ОбновляемыйОбъект[ЗначениеЗаполнения.Ключ] = 
					СтроковыеФункцииКлиентСервер.СтрокаВДату(ЗначениеЗаполнения.Значение, ЧастиДаты.ДатаВремя);
			Иначе
				ОбновляемыйОбъект[ЗначениеЗаполнения.Ключ] = ЗначениеЗаполнения.Значение;
			КонецЕсли;		 
		КонецЕсли; 	
		
	КонецЦикла;	
		
	Попытка
		
		МетаданныеОбъекта = ОбновляемыйОбъект.Метаданные();
		Если гкс_ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
			
			Если ОбновляемыйОбъект.ПометкаУдаления Тогда	
				ОбновляемыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);	
			Иначе	
				Отказ = Ложь;
				гкс_ОбщегоНазначения.СохранитьДокумент(ОбновляемыйОбъект, Отказ, Истина);	
			КонецЕсли;	
		Иначе	
			ОбновляемыйОбъект.Записать();
		КонецЕсли;
		
	Исключение	
		
		ИнфОшибки = ИнформацияОбОшибке();
		СообщениеОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфОшибки);
		КраткоеОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнфОшибки);
		
		ЧастиСообщения = Новый Массив;
		ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Не удалось записать %1'"), ОбновляемыйОбъект));
		ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Причина: %1'"), КраткоеОписаниеОшибки));
		Если ОбновляемыйОбъект.ДополнительныеСвойства.Свойство("СообщенияОбОшибках") Тогда
			ПояснениеОшибки = СтрСоединить(
				ОбновляемыйОбъект.ДополнительныеСвойства.СообщенияОбОшибках, Символы.ПС);
			СообщениеОбОшибке = СтрШаблон("%1
				|
				|%2", СообщениеОбОшибке, ПояснениеОшибки);
			ЧастиСообщения.Добавить(ПояснениеОшибки);
		КонецЕсли;
		
		ТекстОшибки = СтрСоединить(ЧастиСообщения, Символы.ПС);
		
		// Записываем в журнал регистрации полную информацию об ошибке
		ЗаписьЖурналаРегистрации(
			"Интеграция Warehouse. Обработка сообщений",
			УровеньЖурналаРегистрации.Ошибка,
			МетаданныеОбъекта,
			ОбновляемыйОбъект.Ссылка,
			СообщениеОбОшибке);
			
		Если Не ПродолжитьПриОшибке Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
	КонецПопытки;
		
КонецПроцедуры

// Преобразует полученные данные в структуру заполнения объекта в соответствии с правилами конвертации.
//
// Параметры:
//   ОбновляемыйОбъект - СправочникОбъект, ДокументОбъект - Объект конфигурации, 
//   														для которого выполняется конвертация
//   ПравилаКонвертации - Массив из Структура - Массив правил конвертации свойств
//   ПолученныеДанные - Структура - Исходные данные для заполнения объекта
//
// Возвращаемое значение:
//   Структура - Структура данных для заполнения объекта
//
Функция КонвертацияВДанныеЗаполненияОбъекта(ОбновляемыйОбъект, ПравилаКонвертации, ПолученныеДанные) Экспорт

	Перем ЗначениеЗаполнения, ДанныеТЧ;
	
	ДанныеЗаполнения = Новый Структура;
	
	Для Каждого ПравилоКонвертации Из ПравилаКонвертации Цикл
		
		Если ПравилоКонвертации.ИспользуетсяАлгоритмКонвертации Тогда
			
			ПараметрыОбработчика = Новый Массив();
			ПараметрыОбработчика.Добавить(ПравилоКонвертации);
			ПараметрыОбработчика.Добавить(ПолученныеДанные);
			ПараметрыОбработчика.Добавить(ДанныеЗаполнения);
			
			ОбщегоНазначения.ВыполнитьМетодОбъекта(ОбновляемыйОбъект, 
				ПравилоКонвертации.ПравилоКонвертацииСвойства, ПараметрыОбработчика);	
			
		ИначеЕсли ПравилоКонвертации.ЭтоТабличнаяЧасть Тогда
			
			ПравилаКонвертацииТЧ = ПравилоКонвертации.ПравилоКонвертацииСвойства;
			ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ДанныеТЧ); 
			
			ДанныеЗаполненияТЧ = ОбновляемыйОбъект[ПравилоКонвертации.СвойствоКонфигурации].Выгрузить(); 
			ДанныеЗаполненияТЧ.Очистить();
						
			Для Каждого СтрокаТЧ Из ДанныеТЧ Цикл
				
				ДанныеЗаполненияСтрокиТЧ = КонвертацияВДанныеЗаполненияОбъекта(
					ОбновляемыйОбъект, ПравилаКонвертацииТЧ, СтрокаТЧ);
				
				Если ЗначениеЗаполнено(ДанныеЗаполненияСтрокиТЧ) Тогда
					СтрокаДанныхЗаполненияТЧ = ДанныеЗаполненияТЧ.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДанныхЗаполненияТЧ, ДанныеЗаполненияСтрокиТЧ);
				КонецЕсли;	
			КонецЦикла;
			
			ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ДанныеЗаполненияТЧ);
			
		Иначе		
			ПолученныеДанные.Свойство(ПравилоКонвертации.СвойствоИсточника, ЗначениеЗаполнения);
			Если ЗначениеЗаполнено(ЗначениеЗаполнения) Тогда
				
				//Если ТипЗнч(ОбновляемыйОбъект[ПравилоКонвертации.СвойствоКонфигурации]) = Тип("Дата")
				//	И ТипЗнч(ЗначениеЗаполнения) = Тип("Строка") Тогда
				//	
				//ЗначениеЗаполнения = СтроковыеФункцииКлиентСервер.СтрокаВДату(ЗначениеЗаполнения, ЧастиДаты.ДатаВремя);		
				//КонецЕсли;
						
				ДанныеЗаполнения.Вставить(ПравилоКонвертации.СвойствоКонфигурации, ЗначениеЗаполнения);
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Возвращает документ по внешнему идентификатору. Если документ не найден и разрешено создание, 
// создает новый документ указанного типа.
//
// Параметры:
//   Идентификатор - Строка - внешний идентификатор документа
//   ПолноеИмяОбъекта - Строка - полное имя метаданных документа
//   СоздатьОбъект - Булево - признак необходимости создания нового документа при отсутствии найденного
//
// Возвращаемое значение:
//   ДокументОбъект - найденный или созданный документ
//   Неопределено - документ не найден и создание не разрешено
//
Функция ДокументПоВнешнемуИдентификатору(Идентификатор, ПолноеИмяОбъекта, СоздатьОбъект = Ложь) Экспорт
   
	СсылкаНаОбъект = СсылкаНаОбъектПоИдентификатору(Идентификатор, ПолноеИмяОбъекта);
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Результат = СсылкаНаОбъект.ПолучитьОбъект();
		
	ИначеЕсли СоздатьОбъект Тогда
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
		Результат = МенеджерОбъекта.СоздатьДокумент();
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
    Возврат Результат;
	
КонецФункции

// Находит элемент по внешнему идентификатору или создает новый элемент справочника при необходимости.
//
// Параметры:
//   ПолноеИмяОбъекта - Строка - Полное имя объекта метаданных
//   КлючПоиска - Строка, УникальныйИдентификатор - Внешний идентификатор для поиска
//   ДанныеЗаполнения - Произвольный - Данные для заполнения свойств нового объекта
//   СоздаватьЕслиНеНайден - Булево - Признак создания нового объекта, если не найден
//
// Возвращаемое значение:
//   - СправочникСсылка - Найденная или созданная ссылка на объект
//   - Неопределено - Объект не найден и создание запрещено
//
Функция ЭлементПоВнешнимДанным(ПолноеИмяОбъекта, КлючПоиска, ДанныеЗаполнения, СоздаватьЕслиНеНайден = Истина) Экспорт
	
	СсылкаНаОбъект = СсылкаНаОбъектПоИдентификатору(КлючПоиска, ПолноеИмяОбъекта);
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда	
		Результат = СсылкаНаОбъект;
		
	ИначеЕсли СоздаватьЕслиНеНайден Тогда	
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
		НовыйОбъект = Менеджер.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НовыйОбъект, ДанныеЗаполнения);	
		НовыйОбъект.Записать();
		
		Результат = НовыйОбъект.Ссылка;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на объект по идентификатору внешней системы
//
// Параметры:
//   Идентификатор - Строка, Число - значение ключа из внешней системы
//   ПолноеИмяОбъекта - Строка - полное имя объекта вида "Справочник.гкс_ЭтранСтраны"
//   ВладелецСправочника - СправочникСсылка - ссылка на владельца элемента справочника
//
// Возвращаемое значение:
//   СправочникСсылка, ДокументСсылка - ссылка на найденный объект
//   Неопределено - объект не найден
//
Функция СсылкаНаОбъектПоИдентификатору(Идентификатор, ПолноеИмяОбъекта, ВладелецСправочника = Неопределено) Экспорт
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
	ИмяРеквизитаКлюча = МенеджерОбъекта.ИмяКлючевогоСвойства();
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор); 
	
	Если ВладелецСправочника <> Неопределено
		И ТипЗнч(ВладелецСправочника) = Тип("СправочникСсылка") Тогда
		
		 ТекстУсловияПоВладельцу = "И Объект.Владелец = &ВладелецСправочника";
		 Запрос.УстановитьПараметр("ВладелецСправочника", ВладелецСправочника);
	Иначе	 
		 ТекстУсловияПоВладельцу = "";
	КонецЕсли;
	
	СтрокаШаблона = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	Объект.Ссылка КАК Ссылка
				|ИЗ
				|	%1 КАК Объект
				|ГДЕ
				|	Объект.%2 = &Идентификатор
				|	%3";

	Запрос.Текст = СтрШаблон(СтрокаШаблона, ПолноеИмяОбъекта, ИмяРеквизитаКлюча, ТекстУсловияПоВладельцу);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Результат = МенеджерОбъекта.ПустаяСсылка();
	КонецЕсли;
	
    Возврат Результат;
	
КонецФункции

// Конвертация предопределенных типов проб.
// 
// Параметры:
//  ТипВнешнейПробы - СправочникСсылка.гкс_ТипыВнешнихПробWarehouse - Тип внешней пробы
// 
// Возвращаемое значение:
//  Произвольный, ПеречислениеСсылка.гкс_НазначенияИспользованияКачества - Конвертация предопределенных типов проб
//
Функция КонвертацияПредопределенныхТиповПроб(ТипВнешнейПробы) Экспорт
	
	МенеджерНазначения = Перечисления.гкс_НазначенияИспользованияКачества;
	МенеджерТиповПроб = Справочники.гкс_ТипыВнешнихПробWarehouse;
	
	СоответствиеПредопределенных =  Новый Соответствие;
	СоответствиеПредопределенных.Вставить(МенеджерТиповПроб.Лаборант, МенеджерНазначения.ЛаборантВнешниеПробы);
	СоответствиеПредопределенных.Вставить(МенеджерТиповПроб.Элеватор, МенеджерНазначения.ЭлеваторВнешниеПробы);
	СоответствиеПредопределенных.Вставить(МенеджерТиповПроб.ЛотНаТысячуТон, 
											МенеджерНазначения.КомпозитВнешниеПробыНаТысячуТон); 
	
	Результат = СоответствиеПредопределенных.Получить(ТипВнешнейПробы);
	
	Возврат ?(Результат = Неопределено, МенеджерНазначения.ПустаяСсылка(), Результат);
	
КонецФункции

// Определяет вид перевозки по номеру транспортного средства.
// 
// Параметры:
//  НомерТранспортногоСредсвта - Строка - Номер транспортного средсвта
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_ТипыТранспортныхСредствДоставки - Вид перевозки
//
Функция ВидПеревозки(НомерТранспортногоСредсвта) Экспорт
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерТранспортногоСредсвта) Тогда
		Результат = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт;
	Иначе	                                                              
	    Результат = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

// Находит элемент справочника "ТранспортныеСредства" по номер ТС из warehouse.
// 
// Параметры:
//  НомерТС - Строка - Номер ТС
// 
// Возвращаемое значение:
//  СправочникСсылка.ТранспортныеСредства - Транспортное средство по номер из warehouse
//
Функция ТранспортноеСредствоПоНомерИзWarehouse(НомерТС) Экспорт
	
	ТекстRUS = "RUS";
			
	Номер = УбратьСпецСимволы(НомерТС);
	ВидПеревозки = ВидПеревозки(Номер);
	
	Если ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
		
		НомерЛатиница 			= Справочники.ТранспортныеСредства.НормироватьНомер(Номер);
		НомерЛатиницаRUS 		= НомерЛатиница + ТекстRUS;
		НомерКирилица       	= ИзменитьНомерНаКирилицу(Номер);
		НомерКирилицаRUS    	= НомерКирилица + ТекстRUS;
		
		РазныеВариантыНомера 	= Новый Структура;
		РазныеВариантыНомера.Вставить("НомерЛатиница", 		НомерЛатиница);
		РазныеВариантыНомера.Вставить("НомерЛатиницаRUS", 	НомерЛатиницаRUS);
		РазныеВариантыНомера.Вставить("НомерКирилица", 		НомерКирилица);
		РазныеВариантыНомера.Вставить("НомерКирилицаRUS", 	НомерКирилицаRUS);
		
		Результат = ПоискТранспортныеСредстваПоНомерам(РазныеВариантыНомера);
		
	Иначе
		Результат = Справочники.ТранспортныеСредства.ТранспортноеСредствоПоНомеру(Номер);
	КонецЕсли;
		
	Возврат Результат;
				
КонецФункции

// Преобразует строку с номерами заявок на перевозку из Warehouse в массив
//
// Параметры:
//   НомерЗаявкиИзWarehouse - Строка - строка с номерами заявок, разделенными символом "/"
//
// Возвращаемое значение:
//   Массив из Строка - массив номеров заявок
//
Функция НомераЗаявокНаПеревозкуВМассив(НомерЗаявкиИзWarehouse) Экспорт

	НомераЗаявок = Новый Массив;
	РазделительНомеров = "/";
	СырыеНомера = СтрРазделить(НомерЗаявкиИзWarehouse, РазделительНомеров);
	МаксИндекс = СырыеНомера.Количество() - 1;
	Для Индекс = 0 По МаксИндекс Цикл
		// пока уберем один некорректный символ "\", если будут другие необходимо написать функцию очистки
		НомерЗаявки = СтрЗаменить(СырыеНомера[Индекс], "\", ""); 
		НомераЗаявок.Вставить(Индекс, НомерЗаявки);
	КонецЦикла;	
	
	Возврат НомераЗаявок;
	
КонецФункции 	

// Имена свойств со значениями дата 
//
//  Возвращаемое значение:
//  	Строка - имена свойств со значениями типа "Дата". 
//
Функция ИменаСвойствСоЗначениямиДата() Экспорт
	
	Возврат "date,createdOn,updatedOn,loadDate";	
	
КонецФункции	

// Производит десериализацию при получении  внешних проб
//
//	Параметры:
//		Свойство - Строка - указывается только при чтении объектов JSON
//		Значение - Произвольный - значение допустимого для сериализации типа
//		ДополнительныеПараметры - Произвольный
//
//  Возвращаемое значение:
//  	Произвольный - значение, десериализованное из JSON. 
//
Функция ДесериализацияСвойствВнешнихПроб(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если СтрНайти(ИменаСвойствСоЗначениямиДата(), Свойство) > 0 Тогда
		ЗначениеДата = ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);	
		Если СтрНайти(Значение, "Z", НаправлениеПоиска.СКонца) > 0 Тогда
			Результат = ЗначениеДата - СмещениеСтандартногоВремени(ЧасовойПоясСеанса());
		Иначе
			Результат = ЗначениеДата;
		КонецЕсли;
	Иначе	
		Результат = Значение;	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выгружает все данные из таблицы справочника по указанному полному имени объекта метаданных.
//
// Параметры:
//   ПолноеИмяОбъекта - Строка - Полное имя объекта метаданного (например, "Справочник.Номенклатура")
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица с данными справочника
//
Функция ТаблицаЭлементовСправочника(ПолноеИмяОбъекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон("ВЫБРАТЬ * ИЗ %1", ПолноеИмяОбъекта);	
	
	РезультатЗапроса = Запрос.Выполнить();	
		
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Ищет элемент в текущих данных информационной базы по заданным параметрам отбора.
//
// Параметры:
//   ТекущиеДанныеИБ - ТаблицаЗначений - таблица с данными для поиска
//   ПараметрыОтбора - Структура - параметры для поиска строк
//
// Возвращаемое значение:
//   СправочникСсылка - ссылка на найденный элемент
//   Неопределено - элемент не найден
//
Функция НайтиСуществующийЭлемент(ТекущиеДанныеИБ, ПараметрыОтбора)
	
	ИндексПервой = 0;
		
	НайденыеЗаписи = ТекущиеДанныеИБ.НайтиСтроки(ПараметрыОтбора);
	Если НайденыеЗаписи.Количество() > 0 Тогда
		Результат = НайденыеЗаписи[ИндексПервой].Ссылка;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УбратьСпецСимволы(Номер) 
		
	ВсеСпецСимволы = "`~!@#$%^&*()-=+[](){}\|/<>?:;№' ";
	
	Для Инд = 1 По СтрДлина(Номер) Цикл
		
		ОдинСимвол = Сред(Номер, Инд, 1);
		
		Если СтрНайти(ВсеСпецСимволы, ОдинСимвол) > 0 Тогда
			Номер = СтрЗаменить(Номер, ОдинСимвол, "");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Номер;
	
КонецФункции

Функция ИзменитьНомерНаКирилицу(Номер)
	
	Результат = "";
	
	Для а = 1 По СтрДлина(Номер) Цикл
		
		СимволПроверки 	= Сред(Номер, а, 1);
		СимволПроверки 	= ВРег(СимволПроверки);
		
		КодСимвола 		= КодСимвола(СимволПроверки);
		                                         													
		ЭтоЦифра 		= СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СимволПроверки);
		ЭтоКириллица    = СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(СимволПроверки);
		ЭтоЛатиница     = СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(СимволПроверки);
		ЭтоБуква 		= ЭтоКириллица Или ЭтоЛатиница;
		
		Если ЭтоЦифра Или ЭтоКириллица Тогда
			
			Результат = Результат + СимволПроверки;
			
		ИначеЕсли ЭтоЛатиница Тогда         
			                                    
			ОбработатьСимволЕслиЭтоЛатиница(Результат, СимволПроверки);
			
		ИначеЕсли Не ЭтоБуква Тогда
			
			ОбработатьСимволЕслиЭтоНеБуква(Результат, СимволПроверки, КодСимвола);
						
		Иначе
			Продолжить;
		КонецЕсли;  			
		
	КонецЦикла;
	
	ЗаменитьДваПробелаНаОдин(Результат);	
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьСимволЕслиЭтоЛатиница(Результат, СимволПроверки)

	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("A", СимволПроверки, "А");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("B", СимволПроверки, "В");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("C", СимволПроверки, "С");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("E", СимволПроверки, "Е");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("H", СимволПроверки, "Н");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("M", СимволПроверки, "М");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("O", СимволПроверки, "О");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("P", СимволПроверки, "Р");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("T", СимволПроверки, "Т");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("X", СимволПроверки, "Х");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("I", СимволПроверки, "І");
	СимволПроверки 	= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("Y", СимволПроверки, "У");
	
	Результат 		= Результат + СимволПроверки;
	
КонецПроцедуры

Процедура ОбработатьСимволЕслиЭтоНеБуква(Результат, СимволПроверки, КодСимвола)

	ЭтоПробелИлиТире = КодСимвола = КодСимвола("-") Или КодСимвола = КодСимвола(" ");
	ЭтоДругиеСимволы = 
		КодСимвола = КодСимвола(".") 
		Или КодСимвола = КодСимвола(",")
		Или КодСимвола = КодСимвола("/")
		Или КодСимвола = КодСимвола(":")
		Или КодСимвола = КодСимвола("\")
		Или КодСимвола = КодСимвола("*")
		Или КодСимвола = КодСимвола(";");
	
	Если ЭтоПробелИлиТире Тогда				
		
		Результат = Результат + СимволПроверки;
		
	КонецЕсли;
		
	Если ЭтоДругиеСимволы Тогда
		
		Результат = Результат + ", ";
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаменитьДваПробелаНаОдин(Результат)

	Пока СтрНайти(Результат, "  ") > 0 Цикл
		Результат = СтрЗаменить(Результат, "  ", " ");		
	КонецЦикла; 
	
КонецПроцедуры

Функция ПоискТранспортныеСредстваПоНомерам(РазныеВариантыНомера)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ТаблицаТС.Ссылка КАК ТранспортноеСредство
				|ИЗ
				|	Справочник.ТранспортныеСредства КАК ТаблицаТС
				|ГДЕ
				|	ТаблицаТС.НомерТранспортногоСредства = &НомерЛатиница
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	ТаблицаТС.Ссылка
				|ИЗ
				|	Справочник.ТранспортныеСредства КАК ТаблицаТС
				|ГДЕ
				|	ТаблицаТС.НомерТранспортногоСредства = &НомерЛатиницаRUS
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	ТаблицаТС.Ссылка
				|ИЗ
				|	Справочник.ТранспортныеСредства КАК ТаблицаТС
				|ГДЕ
				|	ТаблицаТС.НомерТранспортногоСредства = &НомерКирилица
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	ТаблицаТС.Ссылка
				|ИЗ
				|	Справочник.ТранспортныеСредства КАК ТаблицаТС
				|ГДЕ
				|	ТаблицаТС.НомерТранспортногоСредства = &НомерКирилицаRUS";
		
	Запрос.УстановитьПараметр("НомерЛатиница", 		РазныеВариантыНомера.НомерЛатиница);
	Запрос.УстановитьПараметр("НомерЛатиницаRUS", 	РазныеВариантыНомера.НомерЛатиницаRUS);
	Запрос.УстановитьПараметр("НомерКирилица", 		РазныеВариантыНомера.НомерКирилица);
	Запрос.УстановитьПараметр("НомерКирилицаRUS", 	РазныеВариантыНомера.НомерКирилицаRUS);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Справочники.ТранспортныеСредства.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();                 	
		Выборка.Следующий();
		Результат = Выборка.ТранспортноеСредство
	КонецЕсли;
		
	Возврат Результат;	
		
КонецФункции

#КонецОбласти
